# DataFrame

It is used to store data in tabular form

It is a two dimenstional labelled data structure like a table of MySQL.

It contains row and column index.

# Creation of DataFrame

# 1. From Numpy array

In [1]:
import numpy as np
import pandas as pd
arr1 = np.array([10,20,30,40,50])
df=pd.DataFrame(arr1)
df

    0
0  10
1  20
2  30
3  40
4  50

# 2. Using List of Dictionaries

The dictionary keys are taken as column label and the values correspoiding to each key are taken as rows.

In [2]:
list1 = [{"Name":"Shivansh","Marks":50},{"Name":"Dev","Marks":100}]
df = pd.DataFrame(list1)
df

       Name  Marks
0  Shivansh     50
1       Dev    100

In [3]:
dict1 = [{"Shivansh":80,"Rishabh":70,"Dev":85},{"Shivansh":40,"Rishabh":30,"Dev":75}]
df=pd.DataFrame(dict1,index=["Term 1","Term 2"])
df

        Shivansh  Rishabh  Dev
Term 1        80       70   85
Term 2        40       30   75

# 3. Using Dictionary of Lists

Dictionary keys become column labels by default in a DataFrame, and the lists become the row

In [4]:
ds = {"State":["Madhya Pradesh","Maharastra","Uttar Pradesh"],"Capital":["Bhopal","Mumbai","Lucknow"]}
df = pd.DataFrame(ds,index=["1.","2.","3."])
df

             State  Capital
1.  Madhya Pradesh   Bhopal
2.      Maharastra   Mumbai
3.   Uttar Pradesh  Lucknow

In [5]:
import pandas as pd
df = pd.DataFrame({"Age":[85,45],"Height":[785,150]},index=["Arnab","Riya"])
df

       Age  Height
Arnab   85     785
Riya    45     150

# 4. Using a Series

Labels in the sereis object become the column names in the DataFrame object and each series becomes a row in DataFrame.

If the series dont have a common index on them , so the particular sereis that does not have a corresponding value for a label, Nan is inserted.

In [6]:
s1=pd.Series([10,20,30,40,50],index=[1,2,3,4,5])
s2=pd.Series([60,70,80,90,100],index=[1,2,3,4,5])
s3=pd.Series([110,120,130,140,150],index=[1,2,3,4,5])
df=pd.DataFrame([s1,s2,s3],index=["A","B","C"])
df

     1    2    3    4    5
A   10   20   30   40   50
B   60   70   80   90  100
C  110  120  130  140  150

In [7]:
s1=pd.Series([10,20,30,40,50],index=[1,2,3,4,5])
s2=pd.Series([60,70,80,90,100],index=[1,2,3,4,5])
s3=pd.Series([110,120,130,140,150],index=[1,2,6,7,8])
df=pd.DataFrame([s1,s2,s3],index=["A","B","C"])
df

       1      2     3     4      5      6      7      8
A   10.0   20.0  30.0  40.0   50.0    NaN    NaN    NaN
B   60.0   70.0  80.0  90.0  100.0    NaN    NaN    NaN
C  110.0  120.0   NaN   NaN    NaN  130.0  140.0  150.0

# 5. Using a Dictionary of Series

Note that the Dictionary key went as column label and for row labels, specillay indexes needed to be created in the each series

In [20]:
ResultSheet = {"Arnab":pd.Series([90,91,97],index=["Maths","Science","Hindi"]),
              "Riya":pd.Series([100,95,78],index=["Maths","Science","Hindi"]),
              "Ishita":pd.Series([47,100,98],index=["Maths","Science","Hindi"]),
              "Samridhi":pd.Series([97,52,100],index=["Maths","Science","Hindi"]),
              "Rohan":pd.Series([89,82,77],index=["Maths","Science","Hindi"])}
df=pd.DataFrame(ResultSheet)
df

         Arnab  Riya  Ishita  Samridhi  Rohan
Maths       90   100      47        97     89
Science     91    95     100        52     82
Hindi       97    78      98       100     77

In [9]:
s1= pd.Series([90,91,97])
s2 = pd.Series([100,95,78])
s3 = pd.Series([89,82,77])
df = pd.DataFrame({"Arnab":s1,"Riya":s2,"Rohan":s3})
df

   Arnab  Riya  Rohan
0     90   100     89
1     91    95     82
2     97    78     77

# 7. List of Lists 
Note how the list elements went along a row

In [17]:
Teacher=[["Naveen",50000],["Raj",90000],["Niyati",45000]]
df=pd.DataFrame(Teacher,columns=["Name","Salary"],index=[1,2,3])
df

     Name  Salary
1  Naveen   50000
2     Raj   90000
3  Niyati   45000